select авторы.ид_авт, 
       книги.ид_кни, 
	   издательства.ид_изд, 
	   (книги.цена * книги.продажи * гонорары.процент_гонорара) as [Гонорар],
	   гонорары.аванс,
	   (книги.цена * книги.продажи * гонорары.процент_гонорара) - гонорары.аванс as [Осталось выплатить]
from [книги-авторы]
inner join авторы on [книги-авторы].ид_авт = авторы.ид_авт
inner join книги on [книги-авторы].ид_кни = книги.ид_кни
inner join издательства on книги.издательство = издательства.ид_изд
inner join гонорары on книги.ид_кни = гонорары.ид_кни
order by 1 asc, 2 asc, 3 asc
