select (авторы.имя + ' ' + авторы.фамилия) as Автор, 
       count(книги.ид_кни) as [Количество книг],
       sum(книги.цена * книги.продажи * гонорары.процент_гонорара) as [Сумма гонораров],
	   sum(гонорары.аванс) as [Сумма авансов],
	   sum(книги.цена * книги.продажи * гонорары.процент_гонорара - гонорары.аванс) as [Осталось выплатить]
from авторы
inner join [книги-авторы] on авторы.ид_авт = [книги-авторы].ид_авт
inner join книги on книги.ид_кни = [книги-авторы].ид_кни
inner join гонорары on книги.ид_кни = гонорары.ид_кни
group by (авторы.имя + ' ' + авторы.фамилия)
