 select авторы.ид_авт, авторы.имя, авторы.фамилия
 from книги
 inner join [книги-авторы] on книги.жанр = 'биография' and книги.ид_кни = [книги-авторы].ид_кни
 inner join авторы on [книги-авторы].ид_авт = авторы.ид_авт

 select distinct [книги-авторы].ид_авт, 
	(select имя from авторы where авторы.ид_авт = [книги-авторы].ид_авт) as имя,
	(select фамилия from авторы where авторы.ид_авт = [книги-авторы].ид_авт) as фамилия
 from [книги-авторы]
 where ид_кни in (select ид_кни from книги where книги.жанр = 'биография')
